Oryx-Embedded/CycloneTCP/drivers/mac/f2838x_eth_driver.c
/**
 * @file f2838x_eth_driver.c
 * @brief TMS320F2838xD Ethernet MAC driver
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include "inc/hw_emac.h"
#include "inc/hw_emac_ss.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib_cm/interrupt.h"
#include "driverlib_cm/sysctl.h"
#include "core/net.h"
#include "drivers/mac/f2838x_eth_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//Transmit buffer
#pragma data_alignment = 4
static uint8_t txBuffer[F2838X_ETH_TX_BUFFER_COUNT][F2838X_ETH_TX_BUFFER_SIZE];
//Receive buffer
#pragma data_alignment = 4
static uint8_t rxBuffer[F2838X_ETH_RX_BUFFER_COUNT][F2838X_ETH_RX_BUFFER_SIZE];
//Transmit DMA descriptors
#pragma data_alignment = 4
static F2838xTxDmaDesc txDmaDesc[F2838X_ETH_TX_BUFFER_COUNT];
//Receive DMA descriptors
#pragma data_alignment = 4
static F2838xRxDmaDesc rxDmaDesc[F2838X_ETH_RX_BUFFER_COUNT];

//GCC compiler?
#else

//Transmit buffer
static uint8_t txBuffer[F2838X_ETH_TX_BUFFER_COUNT][F2838X_ETH_TX_BUFFER_SIZE]
   __attribute__((aligned(4)));
//Receive buffer
static uint8_t rxBuffer[F2838X_ETH_RX_BUFFER_COUNT][F2838X_ETH_RX_BUFFER_SIZE]
   __attribute__((aligned(4)));
//Transmit DMA descriptors
static F2838xTxDmaDesc txDmaDesc[F2838X_ETH_TX_BUFFER_COUNT]
   __attribute__((aligned(4)));
//Receive DMA descriptors
static F2838xRxDmaDesc rxDmaDesc[F2838X_ETH_RX_BUFFER_COUNT]
   __attribute__((aligned(4)));

#endif

//Current transmit descriptor
static uint_t txIndex;
//Current receive descriptor
static uint_t rxIndex;


/**
 * @brief TMS320F2838xD Ethernet MAC driver
 **/

const NicDriver f2838xEthDriver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   f2838xEthInit,
   f2838xEthTick,
   f2838xEthEnableIrq,
   f2838xEthDisableIrq,
   f2838xEthEventHandler,
   f2838xEthSendPacket,
   f2838xEthUpdateMacAddrFilter,
   f2838xEthUpdateMacConfig,
   f2838xEthWritePhyReg,
   f2838xEthReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief TMS320F2838xD Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t f2838xEthInit(NetInterface *interface)
{
   error_t error;
   uint32_t temp;
#ifdef ti_sysbios_BIOS___VERS
   Hwi_Params hwiParams;
#endif

   //Debug message
   TRACE_INFO("Initializing TMS320F2838xD Ethernet MAC...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //Enable Ethernet peripheral clock
   SysCtl_enablePeripheral(SYSCTL_PERIPH_CLK_ENET);
   //Reset Ethernet peripheral
   SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_ENET);

   //GPIO configuration
   f2838xEthInitGpio(interface);

   //Perform a software reset
   ETHERNET_DMA_MODE_R |= ETHERNET_DMA_MODE_SWR;
   //Wait for the reset to complete
   while((ETHERNET_DMA_MODE_R & ETHERNET_DMA_MODE_SWR) != 0)
   {
   }

   //Adjust MDC clock range depending on CSR frequency
   ETHERNET_MAC_MDIO_ADDRESS_R = (4 << ETHERNET_MAC_MDIO_ADDRESS_CR_S);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Startup delay
   sleep(10);

   //Use default MAC configuration
   ETHERNET_MAC_CONFIGURATION_R = ETHERNET_MAC_CONFIGURATION_GPSLCE |
      ETHERNET_MAC_CONFIGURATION_PS | ETHERNET_MAC_CONFIGURATION_DO;

   //Set the maximum packet size that can be accepted
   temp = ETHERNET_MAC_EXT_CONFIGURATION_R & ~ETHERNET_MAC_EXT_CONFIGURATION_GPSL_M;
   ETHERNET_MAC_EXT_CONFIGURATION_R = temp | F2838X_ETH_RX_BUFFER_SIZE;

   //Configure MAC address filtering
   f2838xEthUpdateMacAddrFilter(interface);

   //Disable flow control
   ETHERNET_MAC_Q0_TX_FLOW_CTRL_R = 0;
   ETHERNET_MAC_RX_FLOW_CTRL_R = 0;

   //Enable the first RX queue
   ETHERNET_MAC_RXQ_CTRL0_R = (2 << ETHERNET_MAC_RXQ_CTRL0_RXQ0EN_S);

   //Configure DMA operating mode
   ETHERNET_DMA_MODE_R = (0 << ETHERNET_DMA_MODE_INTM_S) |
      (0 << ETHERNET_DMA_MODE_PR_S);

   //Configure system bus mode
   ETHERNET_DMA_SYSBUS_MODE_R |= ETHERNET_DMA_SYSBUS_MODE_AAL;

   //The DMA takes the descriptor table as contiguous
   ETHERNET_DMA_CH0_CONTROL_R = (0 << ETHERNET_DMA_CH0_CONTROL_DSL_S);
   //Configure TX features
   ETHERNET_DMA_CH0_TX_CONTROL_R = (32 << ETHERNET_DMA_CH0_TX_CONTROL_TXPBL_S);

   //Configure RX features
   ETHERNET_DMA_CH0_RX_CONTROL_R = (32 << ETHERNET_DMA_CH0_RX_CONTROL_RXPBL_S) |
      ((F2838X_ETH_RX_BUFFER_SIZE / 4) << ETHERNET_DMA_CH0_RX_CONTROL_RBSZ_S);

   //Enable store and forward mode for transmission
   ETHERNET_MTL_TXQ0_OPERATION_MODE_R |= (7 << ETHERNET_MTL_TXQ0_OPERATION_MODE_TQS_S) |
      (2 << ETHERNET_MTL_TXQ0_OPERATION_MODE_TXQEN_S) |
      ETHERNET_MTL_TXQ0_OPERATION_MODE_TSF;

   //Enable store and forward mode for reception
   ETHERNET_MTL_RXQ0_OPERATION_MODE_R |= (7 << ETHERNET_MTL_RXQ0_OPERATION_MODE_RQS_S) |
      ETHERNET_MTL_RXQ0_OPERATION_MODE_RSF;

   //Initialize DMA descriptor lists
   f2838xEthInitDmaDesc(interface);

   //Prevent interrupts from being generated when statistic counters reach
   //half their maximum value
   ETHERNET_MMC_TX_INTERRUPT_MASK_R = 0xFFFFFFFF;
   ETHERNET_MMC_RX_INTERRUPT_MASK_R = 0xFFFFFFFF;
   ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_R = 0xFFFFFFFF;

