Oryx-Embedded/CycloneTCP/drivers/mac/f2838x_eth_driver.c
   //Disable MAC interrupts
   ETHERNET_MAC_INTERRUPT_ENABLE_R = 0;

   //Enable the desired DMA interrupts
   ETHERNET_DMA_CH0_INTERRUPT_ENABLE_R = ETHERNET_DMA_CH0_INTERRUPT_ENABLE_NIE |
      ETHERNET_DMA_CH0_INTERRUPT_ENABLE_RIE | ETHERNET_DMA_CH0_INTERRUPT_ENABLE_TIE;

#ifdef ti_sysbios_BIOS___VERS
   //Configure Ethernet interrupt
   Hwi_Params_init(&hwiParams);
   hwiParams.enableInt = FALSE;
   hwiParams.priority = F2838X_ETH_IRQ_PRIORITY;

   //Register interrupt handler
   Hwi_create(INT_EMAC, (Hwi_FuncPtr) f2838xEthIrqHandler, &hwiParams, NULL);
#else
   //Register interrupt handler
   Interrupt_registerHandler(INT_EMAC, f2838xEthIrqHandler);
   //Configure Ethernet interrupt priority
   Interrupt_setPriority(INT_EMAC, F2838X_ETH_IRQ_PRIORITY);
#endif

   //Enable MAC transmission and reception
   ETHERNET_MAC_CONFIGURATION_R |= ETHERNET_MAC_CONFIGURATION_TE |
      ETHERNET_MAC_CONFIGURATION_RE;

   //Enable DMA transmission and reception
   ETHERNET_DMA_CH0_TX_CONTROL_R |= ETHERNET_DMA_CH0_TX_CONTROL_ST;
   ETHERNET_DMA_CH0_RX_CONTROL_R |= ETHERNET_DMA_CH0_RX_CONTROL_SR;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

__weak_func void f2838xEthInitGpio(NetInterface *interface)
{
   //Select MII interface mode
   ETHERNETSS_CTRLSTS_R = (0xA5U << ETHERNETSS_CTRLSTS_WRITE_KEY_S) |
      (0 << ETHERNETSS_CTRLSTS_PHY_INTF_SEL_S);
}


/**
 * @brief Initialize DMA descriptor lists
 * @param[in] interface Underlying network interface
 **/

void f2838xEthInitDmaDesc(NetInterface *interface)
{
   uint_t i;

   //Initialize TX DMA descriptor list
   for(i = 0; i < F2838X_ETH_TX_BUFFER_COUNT; i++)
   {
      //The descriptor is initially owned by the application
      txDmaDesc[i].tdes0 = 0;
      txDmaDesc[i].tdes1 = 0;
      txDmaDesc[i].tdes2 = 0;
      txDmaDesc[i].tdes3 = 0;
   }

   //Initialize TX descriptor index
   txIndex = 0;

   //Initialize RX DMA descriptor list
   for(i = 0; i < F2838X_ETH_RX_BUFFER_COUNT; i++)
   {
      //The descriptor is initially owned by the DMA
      rxDmaDesc[i].rdes0 = (uint32_t) rxBuffer[i];
      rxDmaDesc[i].rdes1 = 0;
      rxDmaDesc[i].rdes2 = 0;
      rxDmaDesc[i].rdes3 = ETH_RDES3_OWN | ETH_RDES3_IOC | ETH_RDES3_BUF1V;
   }

   //Initialize RX descriptor index
   rxIndex = 0;

   //Start location of the TX descriptor list
   ETHERNET_DMA_CH0_TXDESC_LIST_ADDRESS_R = (uint32_t) &txDmaDesc[0];
   //Length of the transmit descriptor ring
   ETHERNET_DMA_CH0_TXDESC_RING_LENGTH_R = F2838X_ETH_TX_BUFFER_COUNT - 1;

   //Start location of the RX descriptor list
   ETHERNET_DMA_CH0_RXDESC_LIST_ADDRESS_R = (uint32_t) &rxDmaDesc[0];
   //Length of the receive descriptor ring
   ETHERNET_DMA_CH0_RXDESC_RING_LENGTH_R = F2838X_ETH_RX_BUFFER_COUNT - 1;
}


/**
 * @brief TMS320F2838xD Ethernet MAC timer handler
 *
 * This routine is periodically called by the TCP/IP stack to handle periodic
 * operations such as polling the link state
 *
 * @param[in] interface Underlying network interface
 **/

void f2838xEthTick(NetInterface *interface)
{
   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Handle periodic operations
      interface->phyDriver->tick(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Handle periodic operations
      interface->switchDriver->tick(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Enable interrupts
 * @param[in] interface Underlying network interface
 **/

void f2838xEthEnableIrq(NetInterface *interface)
{
#ifdef ti_sysbios_BIOS___VERS
   //Enable Ethernet MAC interrupts
   Hwi_enableInterrupt(INT_EMAC);
#else
   //Enable Ethernet MAC interrupts
   Interrupt_enable(INT_EMAC);
#endif

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Enable Ethernet PHY interrupts
      interface->phyDriver->enableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Enable Ethernet switch interrupts
      interface->switchDriver->enableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Disable interrupts
 * @param[in] interface Underlying network interface
 **/

void f2838xEthDisableIrq(NetInterface *interface)
{
#ifdef ti_sysbios_BIOS___VERS
   //Disable Ethernet MAC interrupts
   Hwi_disableInterrupt(INT_EMAC);
#else
   //Disable Ethernet MAC interrupts
   Interrupt_disable(INT_EMAC);
#endif

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Disable Ethernet PHY interrupts
      interface->phyDriver->disableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Disable Ethernet switch interrupts
      interface->switchDriver->disableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief TMS320F2838xD Ethernet MAC interrupt service routine
 **/

__interrupt void f2838xEthIrqHandler(void)
{
   bool_t flag;
   uint32_t status;

   //Interrupt service routine prologue
   osEnterIsr();

   //This flag will be set if a higher priority task must be woken
   flag = FALSE;

   //Read DMA status register
   status = ETHERNET_DMA_CH0_STATUS_R;

   //Packet transmitted?
   if((status & ETHERNET_DMA_CH0_STATUS_TI) != 0)
   {
      //Clear TI interrupt flag
      ETHERNET_DMA_CH0_STATUS_R = ETHERNET_DMA_CH0_STATUS_TI;

      //Check whether the TX buffer is available for writing
      if((txDmaDesc[txIndex].tdes3 & ETH_TDES3_OWN) == 0)
      {
         //Notify the TCP/IP stack that the transmitter is ready to send
         flag |= osSetEventFromIsr(&nicDriverInterface->nicTxEvent);
      }
   }

   //Packet received?
   if((status & ETHERNET_DMA_CH0_STATUS_RI) != 0)
   {
      //Clear RI interrupt flag
      ETHERNET_DMA_CH0_STATUS_R = ETHERNET_DMA_CH0_STATUS_RI;

      //Set event flag
      nicDriverInterface->nicEvent = TRUE;
      //Notify the TCP/IP stack of the event
      flag |= osSetEventFromIsr(&nicDriverInterface->netContext->event);
   }

   //Clear NIS interrupt flag
   ETHERNET_DMA_CH0_STATUS_R = ETHERNET_DMA_CH0_STATUS_NIS;

