Oryx-Embedded/CycloneTCP/drivers/mac/f2838x_eth_driver.c
               //The upper 6 bits in the CRC register are used to index the
               //contents of the hash table
               k = (crc >> 26) & 0x3F;

               //Update hash table contents
               hashTable[k / 32] |= (1 << (k % 32));
            }
            else
            {
               //Up to 3 additional MAC addresses can be specified
               if(j < 3)
               {
                  //Save the unicast address
                  unicastMacAddr[j++] = entry->addr;
               }
            }
         }
      }

      //Configure the first unicast address filter
      if(j >= 1)
      {
         //When the AE bit is set, the entry is used for perfect filtering
         ETHERNET_MAC_ADDRESS1_LOW_R = unicastMacAddr[0].w[0] | (unicastMacAddr[0].w[1] << 16);
         ETHERNET_MAC_ADDRESS1_HIGH_R = unicastMacAddr[0].w[2] | ETHERNET_MAC_ADDRESS1_HIGH_AE;
      }
      else
      {
         //When the AE bit is cleared, the entry is ignored
         ETHERNET_MAC_ADDRESS1_LOW_R = 0;
         ETHERNET_MAC_ADDRESS1_HIGH_R = 0;
      }

      //Configure the second unicast address filter
      if(j >= 2)
      {
         //When the AE bit is set, the entry is used for perfect filtering
         ETHERNET_MAC_ADDRESS2_LOW_R = unicastMacAddr[1].w[0] | (unicastMacAddr[1].w[1] << 16);
         ETHERNET_MAC_ADDRESS2_HIGH_R = unicastMacAddr[1].w[2] | ETHERNET_MAC_ADDRESS2_HIGH_AE;
      }
      else
      {
         //When the AE bit is cleared, the entry is ignored
         ETHERNET_MAC_ADDRESS2_LOW_R = 0;
         ETHERNET_MAC_ADDRESS2_HIGH_R = 0;
      }

      //Configure the third unicast address filter
      if(j >= 3)
      {
         //When the AE bit is set, the entry is used for perfect filtering
         ETHERNET_MAC_ADDRESS3_LOW_R = unicastMacAddr[2].w[0] | (unicastMacAddr[2].w[1] << 16);
         ETHERNET_MAC_ADDRESS3_HIGH_R = unicastMacAddr[2].w[2] | ETHERNET_MAC_ADDRESS3_HIGH_AE;
      }
      else
      {
         //When the AE bit is cleared, the entry is ignored
         ETHERNET_MAC_ADDRESS3_LOW_R = 0;
         ETHERNET_MAC_ADDRESS3_HIGH_R = 0;
      }

      //Check whether frames with a multicast destination address should be
      //accepted
      if(interface->acceptAllMulticast)
      {
         //Configure the receive filter
         ETHERNET_MAC_PACKET_FILTER_R = ETHERNET_MAC_PACKET_FILTER_HPF |
            ETHERNET_MAC_PACKET_FILTER_PM;
      }
      else
      {
         //Configure the receive filter
         ETHERNET_MAC_PACKET_FILTER_R = ETHERNET_MAC_PACKET_FILTER_HPF |
            ETHERNET_MAC_PACKET_FILTER_HMC;

         //Configure the multicast hash table
         ETHERNET_MAC_HASH_TABLE_REG0_R = hashTable[0];
         ETHERNET_MAC_HASH_TABLE_REG1_R = hashTable[1];

         //Debug message
         TRACE_DEBUG("  MAC_HASH_TABLE_REG0 = 0x%08" PRIX32 "\r\n", ETHERNET_MAC_HASH_TABLE_REG0_R);
         TRACE_DEBUG("  MAC_HASH_TABLE_REG1 = 0x%08" PRIX32 "\r\n", ETHERNET_MAC_HASH_TABLE_REG1_R);
      }
   }

   //Successful processing
   return NO_ERROR;
}


/**
 * @brief Adjust MAC configuration parameters for proper operation
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t f2838xEthUpdateMacConfig(NetInterface *interface)
{
   uint32_t config;

   //Read current MAC configuration
   config = ETHERNET_MAC_CONFIGURATION_R;

   //10BASE-T or 100BASE-TX operation mode?
   if(interface->linkSpeed == NIC_LINK_SPEED_100MBPS)
   {
      config |= ETHERNET_MAC_CONFIGURATION_FES;
   }
   else
   {
      config &= ~ETHERNET_MAC_CONFIGURATION_FES;
   }

   //Half-duplex or full-duplex mode?
   if(interface->duplexMode == NIC_FULL_DUPLEX_MODE)
   {
      config |= ETHERNET_MAC_CONFIGURATION_DM;
   }
   else
   {
      config &= ~ETHERNET_MAC_CONFIGURATION_DM;
   }

   //Update MAC configuration register
   ETHERNET_MAC_CONFIGURATION_R = config;

   //Successful processing
   return NO_ERROR;
}


/**
 * @brief Write PHY register
 * @param[in] opcode Access type (2 bits)
 * @param[in] phyAddr PHY address (5 bits)
 * @param[in] regAddr Register address (5 bits)
 * @param[in] data Register value
 **/

void f2838xEthWritePhyReg(uint8_t opcode, uint8_t phyAddr,
   uint8_t regAddr, uint16_t data)
{
   uint32_t temp;

   //Valid opcode?
   if(opcode == SMI_OPCODE_WRITE)
   {
      //Take care not to alter MDC clock configuration
      temp = ETHERNET_MAC_MDIO_ADDRESS_R & ETHERNET_MAC_MDIO_ADDRESS_CR_M;
      //Set up a write operation
      temp |= ETHERNET_MAC_MDIO_ADDRESS_GOC_0 | ETHERNET_MAC_MDIO_ADDRESS_GB;

      //PHY address
      temp |= (phyAddr <<ETHERNET_MAC_MDIO_ADDRESS_PA_S) &
         ETHERNET_MAC_MDIO_ADDRESS_PA_M;

      //Register address
      temp |= (regAddr << ETHERNET_MAC_MDIO_ADDRESS_RDA_S) &
         ETHERNET_MAC_MDIO_ADDRESS_RDA_M;

      //Data to be written in the PHY register
      ETHERNET_MAC_MDIO_DATA_R = data & ETHERNET_MAC_MDIO_DATA_GD_M;

      //Start a write operation
      ETHERNET_MAC_MDIO_ADDRESS_R = temp;
      //Wait for the write to complete
      while((ETHERNET_MAC_MDIO_ADDRESS_R & ETHERNET_MAC_MDIO_ADDRESS_GB) != 0)
      {
      }
   }
   else
   {
      //The MAC peripheral only supports standard Clause 22 opcodes
   }
}


/**
 * @brief Read PHY register
 * @param[in] opcode Access type (2 bits)
 * @param[in] phyAddr PHY address (5 bits)
 * @param[in] regAddr Register address (5 bits)
 * @return Register value
 **/

uint16_t f2838xEthReadPhyReg(uint8_t opcode, uint8_t phyAddr,
   uint8_t regAddr)
{
   uint16_t data;
   uint32_t temp;

   //Valid opcode?
   if(opcode == SMI_OPCODE_READ)
   {
      //Take care not to alter MDC clock configuration
      temp = ETHERNET_MAC_MDIO_ADDRESS_R & ETHERNET_MAC_MDIO_ADDRESS_CR_M;

      //Set up a read operation
      temp |= ETHERNET_MAC_MDIO_ADDRESS_GOC_1 |
         ETHERNET_MAC_MDIO_ADDRESS_GOC_0 | ETHERNET_MAC_MDIO_ADDRESS_GB;

      //PHY address
      temp |= (phyAddr <<ETHERNET_MAC_MDIO_ADDRESS_PA_S) &
         ETHERNET_MAC_MDIO_ADDRESS_PA_M;

      //Register address
      temp |= (regAddr << ETHERNET_MAC_MDIO_ADDRESS_RDA_S) &
         ETHERNET_MAC_MDIO_ADDRESS_RDA_M;

      //Start a read operation
      ETHERNET_MAC_MDIO_ADDRESS_R = temp;
      //Wait for the read to complete
      while((ETHERNET_MAC_MDIO_ADDRESS_R & ETHERNET_MAC_MDIO_ADDRESS_GB) != 0)
      {
      }

      //Get register value
      data = ETHERNET_MAC_MDIO_DATA_R & ETHERNET_MAC_MDIO_DATA_GD_M;
   }
   else
   {
      //The MAC peripheral only supports standard Clause 22 opcodes
      data = 0;
   }

   //Return the value of the PHY register
   return data;
}


/**
 * @brief CRC calculation
 * @param[in] data Pointer to the data over which to calculate the CRC
 * @param[in] length Number of bytes to process
 * @return Resulting CRC value
 **/

uint32_t f2838xEthCalcCrc(const void *data, size_t length)
{
   uint_t i;
   uint_t j;
   uint32_t crc;
   const uint8_t *p;

   //Point to the data over which to calculate the CRC
   p = (uint8_t *) data;
   //CRC preset value
   crc = 0xFFFFFFFF;

   //Loop through data
   for(i = 0; i < length; i++)
   {
      //The message is processed bit by bit
      for(j = 0; j < 8; j++)
      {
         //Update CRC value
         if((((crc >> 31) ^ (p[i] >> j)) & 0x01) != 0)
         {
            crc = (crc << 1) ^ 0x04C11DB7;
         }
         else
         {
            crc = crc << 1;
         }
      }
   }

   //Return CRC value
   return ~crc;
}
